/*******************************************************************************
 *
 * tn40xx_ Driver
 *
 * This program is free software; you can redistribute it and/or modify
 * it under the terms of the GNU General Public License as published by
 * the Free Software Foundation; either version 2 of the License, or
 * (at your option) any later version.
 *
 *******************************************************************************/
#ifndef _TN40XX_H
#define _TN40XX_H

#include <linux/module.h>
#include <linux/kernel.h>
#include <linux/netdevice.h>
#include <linux/etherdevice.h>
#include <linux/pci.h>
#include <linux/delay.h>
#include <linux/ethtool.h>
#include <linux/mii.h>
#include <linux/crc32.h>
#include <linux/msi.h>
#include <linux/list.h>
#ifndef __VMKLNX__
#include <linux/uaccess.h>
#endif
#include <linux/in.h>
#include <linux/ip.h>
#include <linux/tcp.h>
#include <linux/udp.h>
#include <linux/sched.h>
#ifndef __VMKLNX__
#include <linux/tty.h>
#endif
#include <linux/if_ether.h>
#include <linux/if_vlan.h>
#include <linux/interrupt.h>
#include <linux/vmalloc.h>
#include <linux/version.h>
#include <asm/byteorder.h>
#include "tn40_ioctl.h"
#ifdef __VMKLNX__
#define VM_KLNX
#include <linux/mm.h>
#endif /* __VMKLNX__ */

#ifdef _DRIVER_RESUME_
#undef __init
#define __init
#undef __initdata
#define __initdata
#endif

#define BDX_DRV_VERSION   	"0.3.6.17.2"
#define DRIVER_AUTHOR     	"Tehuti networks"
#define BDX_DRV_DESC      	"Tehuti Network Driver"

#define DBG1(fmt, args...)		            if (g_memLog > 1) memLog(fmt, ##args)
#elif defined(TN40_DEBUG)
#define	DBG(fmt, args...)					if (g_dbg) 		  printk(KERN_ERR  BDX_DRV_NAME": ""%s:%-5d: " fmt, __func__, __LINE__, ## args)
#define DBG1(fmt, args...)		            if (g_dbg > 1)    printk(KERN_ERR  BDX_DRV_NAME": ""%s:%-5d: " fmt, __func__, __LINE__, ## args)
#else
#define DBG(fmt, args...)
#define DBG1(fmt, args...)
#endif

//				F T R A C E
#if defined(FTRACE)
extern int g_ftrace;
#define FTRACE_ON		g_ftrace = 1
#define FTRACE_OFF		g_ftrace = 0
//#define ENTER        do { if (g_ftrace) printk(KERN_ERR  "%s:%-5d: - enter\n", __func__, __LINE__); } while (0)
//#define RET(args...) do { if (g_ftrace) printk(KERN_ERR  "%s:%-5d: - return\n", __func__, __LINE__); return args; } while (0)
#define ENTER        do { if (g_ftrace) printk(KERN_ERR  BDX_DRV_NAME": %s: - enter\n" , __func__); } while (0)
#define RET(args...) do { if (g_ftrace) printk(KERN_ERR  BDX_DRV_NAME": %s: - return\n", __func__); return args; } while (0)
#define EXIT         do { if (g_ftrace) printk(KERN_ERR  BDX_DRV_NAME": %s(): - exit\n", __func__);return;} while (0)
#else
#define FTRACE_ON
#define FTRACE_OFF
#define ENTER
#define EXIT
#define RET(args...)   		                return args
#endif

#ifdef REGLOG
extern int g_regLog;
#define REGLOG_ON							g_regLog = 1
#define REGLOG_OFF							g_regLog = 0
u32  bdx_readl(void *base, u32 reg);
#define READ_REG(pp, reg)     bdx_readl(pp->pBdxRegs, reg)
#define WRITE_REG(pp, reg, val) { \
  if (g_regLog) MSG("regW 0x%x 0x%x\n", reg, val );\
  writel(val, pp->pBdxRegs + reg); \
}
#else
#define REGLOG_ON
#define REGLOG_OFF
#ifdef TN40_THUNDERBOLT
struct bdx_priv;
u32 tbReadReg(struct bdx_priv *priv, u32 reg);
#define READ_REG(pp, reg)     tbReadReg(pp, reg)
#else
#define READ_REG(pp, reg)     readl(pp->pBdxRegs + reg)
#endif
#define WRITE_REG(pp, reg, val)   writel(val, pp->pBdxRegs + reg)

#endif

#define TEHUTI_VID  			0x1FC9
#define DLINK_VID  				0x1186
#define ASUS_VID				0x1043
#define EDIMAX_VID				0x1432
#define PROMISE_VID				0x105a
#define BUFFALO_VID				0x1154

#define MDIO_SPEED_1MHZ 		(1)
#define MDIO_SPEED_6MHZ			(6)

/* Driver states */

#define	BDX_STATE_NONE			(0x00000000)
#define	BDX_STATE_HW_STOPPED	(0x00000001)
#define BDX_STATE_STARTED		(0x00000002)
#define BDX_STATE_OPEN			(0x00000004)

enum LOAD_FW
{
	NO_FW_LOAD=0,
	FW_LOAD,
};

/* Supported PHYs */

enum PHY_TYPE
{
    PHY_TYPE_NA,      		/* Port not exists or unknown PHY	*/
    PHY_TYPE_CX4,     		/* PHY works without initialization */
    PHY_TYPE_QT2025,  		/* QT2025 10 Gbps SFP+    			*/
    PHY_TYPE_MV88X3120,  	/* MV88X3120  10baseT  				*/
    PHY_TYPE_MV88X3310,  	/* MV88X3310  10NbaseT 				*/
    PHY_TYPE_MV88E2010,  	/* MV88E2010  5NbaseT  				*/
    PHY_TYPE_TLK10232,		/* TI TLK10232 SFP+					*/
    PHY_TYPE_AQR105,		/* AQR105 10baseT					*/
    PHY_TYPE_CNT
};

enum PHY_LEDS_OP
{
    PHY_LEDS_SAVE,
    PHY_LEDS_RESTORE,
    PHY_LEDS_ON,
    PHY_LEDS_OFF,
    PHY_LEDS_CNT
};

/* Supported devices */
struct bdx_device_descr
{
    short vid;
    short pid;
    short subdev;
    short msi;
    short ports;
    short phya;
    short phyb;
    char  *name;
};

/* Compile Time Switches */
/* start */
//#define USE_TIMERS
#define BDX_MSI
/* end */

#define BDX_DEF_MSG_ENABLE  (NETIF_MSG_DRV   | \
                 NETIF_MSG_PROBE | \
                 NETIF_MSG_LINK)

/* RX copy break size */
#define BDX_COPYBREAK     	257
#define BDX_MSI_STRING 		"msi "
/*
 * netdev tx queue len for Luxor. The default value is 1000.
 * ifconfig eth1 txqueuelen 3000 - to change it at runtime.
 */
#define BDX_NDEV_TXQ_LEN    3000

#define FIFO_SIZE       	4096
#define FIFO_EXTRA_SPACE    1024

#define MIN(x, y)  ((x) < (y) ? (x) : (y))
#define MAX(x, y)  ((x) > (y) ? (x) : (y))

#if BITS_PER_LONG == 64
#       define H32_64(x)  (u32) ((u64)(x) >> 32)
#       define L32_64(x)  (u32) ((u64)(x) & 0xffffffff)
#elif BITS_PER_LONG == 32
#       define H32_64(x)  0
#       define L32_64(x)  ((u32) (x))
#else               /* BITS_PER_LONG == ?? */
#       error BITS_PER_LONG is undefined. Must be 64 or 32
#endif              /* BITS_PER_LONG */

#ifdef __BIG_ENDIAN
#       define CPU_CHIP_SWAP32(x) (swab32(x))
#       define CPU_CHIP_SWAP16(x) (swab16(x))
#else
#       define CPU_CHIP_SWAP32(x) (x)
#       define CPU_CHIP_SWAP16(x) (x)
#endif


#ifndef DMA_64BIT_MASK
#       define DMA_64BIT_MASK  0xffffffffffffffffULL
#endif

#ifndef DMA_32BIT_MASK
#       define DMA_32BIT_MASK  0x00000000ffffffffULL
#endif

#ifndef NET_IP_ALIGN
#       define NET_IP_ALIGN 2
#endif

#ifndef NETDEV_TX_OK
#       define NETDEV_TX_OK 0
#endif

#define LUXOR_MAX_PORT     2
#define BDX_MAX_RX_DONE    150
#define BDX_TXF_DESC_SZ    16
#define BDX_MAX_TX_LEVEL   (priv->txd_fifo0.m.memsz - 16)
#define BDX_MIN_TX_LEVEL   256
#define BDX_NO_UPD_PACKETS 40
#define BDX_MAX_MTU		   (1 << 14)
#define BDX_IRQ_TYPE    IRQF_SHARED
struct pci_nic
{
    int port_num;
    void __iomem *regs;
    int irq_type;
    struct bdx_priv *priv;
};

enum { IRQ_INTX, IRQ_MSI, IRQ_MSIX };

#define PCK_TH_MULT   128
#define INT_COAL_MULT 2

#define BITS_MASK(nbits)            ((1 << nbits)-1)
#define GET_BITS_SHIFT(x, nbits, nshift)    (((x) >> nshift)&BITS_MASK(nbits))
#define BITS_SHIFT_MASK(nbits, nshift)      (BITS_MASK(nbits) << nshift)
#define BITS_SHIFT_VAL(x, nbits, nshift)    (((x) & BITS_MASK(nbits)) << nshift)
#define BITS_SHIFT_CLEAR(x, nbits, nshift)  \
        ((x)&(~BITS_SHIFT_MASK(nbits, nshift)))

#define GET_INT_COAL(x)             GET_BITS_SHIFT(x, 15,  0)
#define GET_INT_COAL_RC(x)          GET_BITS_SHIFT(x,  1, 15)
#define GET_RXF_TH(x)               GET_BITS_SHIFT(x,  4, 16)
#define GET_PCK_TH(x)               GET_BITS_SHIFT(x,  4, 20)

#define INT_REG_VAL(coal, coal_rc, rxf_th, pck_th)  \
    ((coal) | ((coal_rc) << 15) | ((rxf_th) << 16) | ((pck_th) << 20))

#if LINUX_VERSION_CODE >= KERNEL_VERSION(2, 6, 31)
#define USE_PAGED_BUFFERS             1
//#define RX_REUSE_PAGES
#if defined(RX_REUSE_PAGES) && !defined(USE_PAGED_BUFFERS)
#define USE_PAGED_BUFFERS
#endif

struct fifo
{
    dma_addr_t  da;     /* Physical address of fifo (used by HW) */
    char        *va;    /* Virtual address of fifo (used by SW) */
    u32     rptr, wptr; /* Cached values of RPTR and WPTR registers,
                   they're 32 bits on both 32 and 64 archs */
    u16     reg_CFG0, reg_CFG1;
    u16     reg_RPTR, reg_WPTR;
    u16     memsz;  /* Memory size allocated for fifo */
    u16     size_mask;
    u16     pktsz;  /* Skb packet size to allocate */
    u16     rcvno;  /* Number of buffers that come from this RXF */
};

struct txf_fifo
{
    struct fifo m;   /* The minimal set of variables used by all fifos  */
};

struct txd_fifo
{
    struct fifo m;   /* The minimal set of variables used by all fifos */
};

struct rxf_fifo
{
    struct fifo m;   /* The minimal set of variables used by all fifos */
};

struct rxd_fifo
{
    struct fifo m;   /* The minimal set of variables used by all fifos */
};

struct bdx_page
{
#ifdef RX_REUSE_PAGES
	struct list_head			free;
	int							ref_count;
	int							reuse_tries;
	int							page_index;
	char						status;
#endif
	struct page 				*page;
	u64 						dma;
};
struct rx_map
{
#ifdef RX_REUSE_PAGES
    struct bdx_page *bdx_page;
#else
    struct bdx_page bdx_page;
#endif
    u64 			dma;
    struct sk_buff  *skb;
#ifdef USE_PAGED_BUFFERS
    u32     		off;
    u32     		size;   /* Mapped area (i.e. page) size */
#endif
};

struct rxdb
{
    int     *stack;
    struct rx_map   *elems;
    int     nelem;
    int     top;
    void	*pkt;
};

union bdx_dma_addr
{
    dma_addr_t  dma;
    struct sk_buff  *skb;
};

/*
 * Entry in the db.
 * if len == 0 addr is dma
 * if len != 0 addr is skb
 */
struct tx_map
{
    union bdx_dma_addr addr;
    int len;
};

/* tx database - implemented as circular fifo buffer*/
struct txdb
{
    struct tx_map   *start; /* Points to the first element     */
    struct tx_map   *end;   /* Points just AFTER the last element  */
    struct tx_map   *rptr;  /* Points to the next element to read  */
    struct tx_map   *wptr;  /* Points to the next element to write */
    int     size;   /* Number of elements in the db    */
};

/*Internal stats structure*/
struct bdx_stats
{
    u64 InUCast;                /* 0x7200 */
    u64 InMCast;                /* 0x7210 */
    u64 InBCast;                /* 0x7220 */
    u64 InPkts;         /* 0x7230 */
    u64 InErrors;               /* 0x7240 */
    u64 InDropped;              /* 0x7250 */
    u64 FrameTooLong;       /* 0x7260 */
    u64 FrameSequenceErrors;    /* 0x7270 */
    u64 InVLAN;         /* 0x7280 */
    u64 InDroppedDFE;       /* 0x7290 */
    u64 InDroppedIntFull;           /* 0x72A0 */
    u64 InFrameAlignErrors;         /* 0x72B0 */

    /* 0x72C0-0x72E0 RSRV */

    u64 OutUCast;               /* 0x72F0 */
    u64 OutMCast;               /* 0x7300 */
    u64 OutBCast;               /* 0x7310 */
    u64 OutPkts;                /* 0x7320 */

    /* 0x7330-0x7360 RSRV */

    u64 OutVLAN;                /* 0x7370 */
    u64 InUCastOctects;         /* 0x7380 */
    u64 OutUCastOctects;            /* 0x7390 */

    /* 0x73A0-0x73B0 RSRV */

    u64 InBCastOctects;         /* 0x73C0 */
    u64 OutBCastOctects;            /* 0x73D0 */
    u64 InOctects;              /* 0x73E0 */
    u64 OutOctects;             /* 0x73F0 */
};
#define PHY_LEDS				(4)
struct bdx_phy_operations
{
	unsigned short leds[PHY_LEDS];
    int  (*mdio_reset)  	  (struct bdx_priv *, 	int, unsigned short);
	u32  (*link_changed)	  (struct bdx_priv *);
	int  (*get_settings)	  (struct net_device *, struct ethtool_cmd *);
	void (*ledset)      	  (struct bdx_priv *, 	enum   PHY_LEDS_OP);
    int  (*set_settings)	  (struct net_device *, struct ethtool_cmd *);
#ifdef ETHTOOL_GLINKSETTINGS
    int	 (*get_link_ksettings)(struct net_device *, struct ethtool_link_ksettings *);
#endif
#ifdef ETHTOOL_SLINKSETTINGS
    int	 (*set_link_ksettings)(struct net_device *, const struct ethtool_link_ksettings *);
#endif
#ifdef _EEE_
#ifdef ETHTOOL_GEEE
    int  (*get_eee)		(struct net_device *, struct ethtool_eee *);
#endif
#ifdef ETHTOOL_SEEE
    int  (*set_eee)		(struct bdx_priv *);
#endif
    int  (*reset_eee)	(struct bdx_priv *);
#endif
    u32  mdio_speed;
};

struct bdx_rx_page_table
{
